simtind/CRED-arduino-core/boards.txt
# Copyright (c) 2014-2015 Arduino LLC.  All right reserved.
#
# This library is free software; you can redistribute it and/or
# modify it under the terms of the GNU Lesser General Public
# License as published by the Free Software Foundation; either
# version 2.1 of the License, or (at your option) any later version.
#
# This library is distributed in the hope that it will be useful,
# but WITHOUT ANY WARRANTY; without even the implied warranty of
# MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
# See the GNU Lesser General Public License for more details.
#
# You should have received a copy of the GNU Lesser General Public
# License along with this library; if not, write to the Free Software
# Foundation, Inc., 51 Franklin St, Fifth Floor, Boston, MA  02110-1301  USA

# based on Adafruit's board support package for SAMD boards, version 1.7.13

menu.cache=Cache
menu.speed=CPU Speed
menu.opt=Optimize
menu.maxqspi=Max QSPI
menu.usbstack=USB Stack
menu.debug=Debug
# -----------------------------------
# lora_sense_m0
# -----------------------------------
lora_sense_m0.name=CRED Lora Sense M0

# VID/PID for Bootloader, Arduino & CircuitPython
lora_sense_m0.vid.0=0x03EB
lora_sense_m0.pid.0=0x2402

# Upload
lora_sense_m0.upload.tool=bossac18
lora_sense_m0.upload.protocol=sam-ba
lora_sense_m0.upload.maximum_size=262144
lora_sense_m0.upload.offset=0x2000
lora_sense_m0.upload.use_1200bps_touch=true
lora_sense_m0.upload.wait_for_upload_port=true
lora_sense_m0.upload.native_usb=true

# Build
lora_sense_m0.build.mcu=cortex-m0plus
lora_sense_m0.build.f_cpu=48000000L
lora_sense_m0.build.usb_product="CRED Lora Sense M0"
lora_sense_m0.build.usb_manufacturer="Critical Re-Design"
lora_sense_m0.build.board=LORA_SENSE_M0
lora_sense_m0.build.core=adafruit:arduino
lora_sense_m0.build.extra_flags=-DARDUINO_SAMD_ZERO -DARM_MATH_CM0PLUS -D__SAMD21G18A__ -DCRYSTALLESS {build.usb_flags}
lora_sense_m0.build.ldscript=linker_scripts/gcc/flash_with_bootloader.ld
lora_sense_m0.build.openocdscript=scripts/openocd/daplink_samd21.cfg
lora_sense_m0.build.variant=lora_sense_m0
lora_sense_m0.build.variant_system_lib=
lora_sense_m0.build.vid=0x03EB
lora_sense_m0.build.pid=0x2402
lora_sense_m0.bootloader.tool=openocd
lora_sense_m0.bootloader.file=lora_sense_m0/bootloader-lora_sense_m0-1.0.0.bin

# Menu: Cache (only for SAMD51/SAME51)


# Menu: Speed (only for SAMD51/SAME51)



# Menu: Optimization
lora_sense_m0.menu.opt.small=Small (-Os) (standard)
lora_sense_m0.menu.opt.small.build.flags.optimize=-Os
lora_sense_m0.menu.opt.fast=Fast (-O2)
lora_sense_m0.menu.opt.fast.build.flags.optimize=-O2
lora_sense_m0.menu.opt.faster=Faster (-O3)
lora_sense_m0.menu.opt.faster.build.flags.optimize=-O3
lora_sense_m0.menu.opt.fastest=Fastest (-Ofast)
lora_sense_m0.menu.opt.fastest.build.flags.optimize=-Ofast
lora_sense_m0.menu.opt.dragons=Here be dragons (-Ofast -funroll-loops)
lora_sense_m0.menu.opt.dragons.build.flags.optimize=-Ofast -funroll-loops

# Menu: USB Stack
lora_sense_m0.menu.usbstack.arduino=Arduino
lora_sense_m0.menu.usbstack.tinyusb=TinyUSB
lora_sense_m0.menu.usbstack.tinyusb.build.flags.usbstack=-DUSE_TINYUSB

# Menu: Debug
lora_sense_m0.menu.debug.off=Off
lora_sense_m0.menu.debug.on=On
lora_sense_m0.menu.debug.on.build.flags.debug=-g
